Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemTagBadView
Beam System Tags can only be placed in plan , elevation and 3D views.

Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemHasTooManyBeams
A beam system is trying to create more than 500 beams. Please use multiple beam systems if more than 500 beams are desired.

Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures.BeamSystemEdgeBeamTooWide
Beam of user-defined type does not fit into beam system with clear spacing layout rule. Beam type is reset to default.

Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures
Failures about BeamSystem.